demo-output/website/campaign/F3_runs/diamond/M2.5_eps5/coarse/0/p
/*--------------------------------*- C++ -*----------------------------------*\
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 1;
    }
    outlet
    {
        type            zeroGradient;
    }
    bottom
    {
        type            symmetryPlane;
    }
    top
    {
        type            zeroGradient;
    }
    obstacle
    {
        type            zeroGradient;
    }
    defaultFaces
    {
        type            empty;
    }
}
